/**
 * 播放列表
 * @type {Array}
 * 请用数组来定义总列表
 * 再用二维数组定义每个列表
 * 其中列表里的每首歌需用对象定义
 * 请在每个列表中的第一个元素定义列表信息（必须位于第一位）
 * 列表信息必须有一个basic属性，值为true
 * 还要有一个name属性，值为列表名称
 * 可选参数为singer、image，用于为定义的该属性的歌曲调用
 * 每首歌必须有name、src、lrc三个属性
 * src为歌曲相对于index.html的相对路径或绝对路径
 * 可选singer和image属性
 * 在每首歌没有定义singer或image时将使用列表的singer或image
 * 请确保一定有一个被定义
 * 其中name为歌曲名称
 * src为歌曲文件路径
 * lrc为歌词，请用\n或\r将每行歌词隔开，否则无法识别
 */
var mplayer_song = [
	[{
			"basic": true,
			"name": "默认",
			"singer": "某不知名白狼",
			"img": "image/pic/head.jpg"
		},
		{
			"name": "最后的旅行",
			"singer": "Rainton桐",
			"img": "audio/album/music1.jpg",
			"src": "audio/music1.mp3",
			"lrc": "[ti:最后的旅行]\n[ar:龙族]\n[al:Rainton桐]\n[00:00.00]龙族-最后的旅行\n[00:15.00]沿着电车隧道一直向前 \n[00:18.00]踏着枕木间的落叶来到山巅\n[00:21.00]认真地遵守与你的诺言\n[00:25.00]三个数之后才轻轻睁开双眼\n[00:28.00]暮色如海潮般涌入视线\n[00:31.00]染红了枫林一直蔓延到天边\n[00:35.00]山下的摩天轮还在回旋\n[00:39.00]一圈又一圈似乎永远都不会疲倦\n[00:45.00]\n[00:56.00]落日一点一点触及海面 \n[01:00.00]和倒影一起组成了完整的圆\n[01:04.00]余晖笼罩小镇静谧安恬 \n[01:07.00]夜幕降临前还可以再看一眼\n[01:11.00]静静坐在矿井的屋檐下\n[01:14.00]本子上写满千奇百怪的问答\n[01:17.00]突然明白原来世界很大\n[01:21.00]只是可惜我已没有时间探察\n[01:24.00]遇见了你 仿佛命定轨迹\n[01:29.00]每一天都是美好的回忆 珍藏在心底\n[01:35.00]命运十字路口 谢谢你曾挽留\n[01:41.00]站在时间尽头 再回首 世界如此温柔\n[01:49.00]哪怕明天过后 终究逃不开这诅咒\n[01:56.00]我已觉得足够\n[02:03.00]东京天空树被闪电点燃\n[02:06.00]拔地而起插入漆黑的云端\n[02:10.00]推开窗看雨夜焰火绚烂\n[02:14.00]映入眼瞳的城市如星海一般\n[02:18.00]把所有玩具都换了标签\n[02:21.00]是不是就可以将你留在身边 \n[02:24.00]再长的旅途也会有终点 \n[02:28.00]隔着车窗听你说那一声再见\n[02:31.00]多么希望 行程没有归期\n[02:37.00]一起逃亡在温暖阳光里\n[02:44.00]守着两只小怪兽的秘密\n[02:48.00]紧紧拥抱似乎永不会分离\n[02:52.00]每当看见你 就好像另一个自己\n[02:59.00]命运十字路口 \n[03:02.00]谢谢你曾停留站在时间尽头 再回首 世界如此温柔\n[03:12.00]哪怕明天过后 \n[03:16.00]再看不到新的白昼 我已觉得足够\n[03:26.00]命运十字路口 谢谢你曾停留\n[03:33.00]站在时间尽头 再回首 世界如此温柔\n[03:40.00]纵然雨狂风骤 也不害怕无路可走\n[03:48.00]我们的名字 手牵手\n[03:51.00]欢迎大家\n[03:54.00]关注百度贴吧\n[03:57.00]龙族吧\n"
		},
		{
			"name": "东京不太热",
			"singer": "囧菌",
			"img": "images/error.jpg",
			"src": "audio/music3.mp3",
			"lrc": "[by:九九Lrc歌词网～www.99Lrc.net]\n[00:19.77]收藏夹的照片看了又删\n[00:23.56]去年夏天后就没聊过天\n[00:27.35]一盏一盏街灯烘焙了夜\n[00:31.10]只有手中烟在寂寞地渲染\n[00:34.84]人太多大 部分是漫无目的的走\n[00:38.68]听着歌想 念一个人心痛也不说\n[00:42.27]悄悄看 外边的情侣暧昧牵着手\n[00:46.21]你也牵过手 是左手牵右手\n[00:50.15]叮叮当当 qq响起会是谁呢NaYo\n[00:53.34]会是她吗NaYo\n[00:55.36]什么事呢Ayo\n[00:57.43]假装正经帮她把问题都把问题都摆平NaYo\n[01:00.97]不多聊了NaYo\n[01:02.95]去吃饭了Ayo\n[01:05.67]明明心里很喜欢却保持着距离\n[01:09.21]噢怕被伤害就伪装出高冷的表情\n[01:13.10]以为这样总有一天她会接近你\n[01:16.90]直到有天看见她和别人在一起\n[01:21.29]一盏一盏街灯烘焙了夜\n[01:25.08]只有手中烟在寂寞地渲染\n[01:28.73]收藏夹的照片看了又删\n[01:32.72]去年夏天后就再没聊过天\n[01:36.41]人太多大 部分是漫无目的的走\n[01:40.00]听着歌想 念一个人心痛也不说\n[01:43.85]悄悄看 外边的情侣暧昧牵着手\n[01:47.43]你也牵过手 是左手牵右手\n[01:51.58]叮叮当当 qq响起会是谁呢NaYo\n[01:54.86]会是她吗NaYo\n[01:56.79]什么事呢Ayo\n[01:58.96]假装正经帮她把问题都摆平NaYo\n[02:02.76]不多聊了NaYo\n[02:04.74]去吃饭了Ayo\n[02:07.05]明明心里很喜欢却保持着距离\n[02:10.65]噢怕被伤害就伪装出高冷的表情\n[02:14.44]以为这样总有一天她会接近你\n[02:18.23]直到有天看见她和别人在一起\n[02:22.63]优雅的转身\n[02:24.55]熟悉的音乐\n[02:26.32]是我们曾经的那一段\n[02:30.57]你已经淡出\n[02:32.44]在我时间轴\n[02:34.22]只留下那天的回忆单曲循环\n[02:37.44]叮叮当当 qq响起会是谁呢NaYo\n[02:41.04]会是她吗NaYo\n[02:42.96]什么事呢Ayo\n[02:45.13]假装正经帮她把问题都摆平NaYo\n[02:48.86]不多聊了NaYo\n[02:50.73]去吃饭了Ayo\n[02:53.01]明明心里很喜欢却保持着距离\n[02:56.55]噢怕被伤害就伪装出高冷的表情\n[03:00.44]以为这样总有一天她会接近你\n[03:04.33]直到有天看见她和别人在一起\n[03:08.18]叮叮当当 qq响起会是谁呢NaYo\n[03:11.61]会是她吗NaYo\n[03:13.64]什么事呢Ayo\n[03:15.82]假装正经帮她把问题都摆平NaYo\n[03:19.30]不多聊了NaYo\n[03:21.12]去吃饭了Ayo\n[03:23.69]明明心里很喜欢却保持着距离\n[03:27.23]噢怕被伤害就伪装出高冷的表情\n[03:31.32]以为这样总有一天她会接近你\n[03:35.12]直到有天看见她和别人在一起\n[03:39.01]叮叮当当 qq响起会是谁呢NaYo"
		},
		{
			"name": "銀河鉄道のペンギン (feat. nicamoq)",
			"singer": "Aiobahn Yunomi",
			"img": "audio/album/music2.jpg",
			"src": "audio/music2.mp3",
			"lrc": "[by:Yuminoki仒Wasabi]\n[00:07.97]次は長尾峰へ、長尾峰です\n[00:12.26]出口は右側に変わります\n[00:35.56]遠く汽笛が鳴り響いている 真夜中\n[00:39.98]街の灯火がひとつ消えた\n[00:42.59]さよなら\n[00:44.33]届かない想いは そうきっとなゆた\n[00:48.62]けど今星がほらひとつ増えた\n[00:51.42]懐かしい歌だけ思い出すんだよ\n[00:57.09]あなたのやさしい声\n[01:01.50]飛べない僕はチケットを握りしめ\n[01:08.95]汽車に乗る\n[01:10.25]何億光年離れていても\n[01:12.36]手を伸ばす僕はペンギン\n[01:14.60]故郷の海にきっと映る\n[01:16.85]あなたを想うよ\n[01:18.96]何億光年離れていても\n[01:21.14]手を伸ばす僕はペンギン\n[01:23.32]故郷の海にきっと映る\n[01:25.68]あなたを想うよ\n[01:35.52]セイブ·ミー\n[01:44.23]セイブ·ミー\n[01:45.73]ああ~\n[01:48.61]テイク·ミー\n[01:49.66]ああ~\n[01:52.85]セイブ·ミー\n[01:53.85]ああ~\n[01:57.18]テイク·ミー\n[01:58.33]ああ~\n[02:01.53]セイブ·ミー\n[02:05.02]こぼれたミルクみたいな川を渡って\n[02:09.41]白鳥の停車場を過ぎたら\n[02:13.74]夜汽車はサウザンクロス 石炭袋を目指して\n[02:17.92]胸の霧もきっと晴れるのでしょう\n[02:20.90]窓の外 流れ星\n[02:23.23]まるで思い出みたい\n[02:26.56]何気ない日常を\n[02:30.85]真っ黒なこのキャンバスに\n[02:35.13]散りばめて輝くよ\n[02:39.61]何億光年ワープしたら\n[02:40.90]あなたに届くの\n[02:43.16]ペンギン\n[02:44.07]故郷の海の塩辛さも\n[02:46.22]忘れてしまうよ\n[02:48.36]本当の幸せをいつか\n[02:49.95]僕は見つけられるのかなあ\n[02:51.95]ペンギン\n[02:52.79]他には何も要らないよ\n[02:54.98]あなたじゃなきゃイヤだよ\n[03:14.49]銀河鉄道は僕を乗せて\n[03:18.04]テイク·ミー\n[03:18.83]故郷の星を遠く離れて\n[03:22.29]セイブ·ミー\n[03:23.13]銀河鉄道は僕を乗せて\n[03:26.61]テイク·ミー\n[03:27.46]夢も絶望もふっと消えて\n[03:31.05]セイブ·ミー\n[03:32.73]ああ~\n[03:36.13]ああ~\n[03:40.47]ああ~\n[03:44.90]ああ~\n[03:49.20]ああ～\n"
		}
	],
	[{
			"basic": true,
			"name": "吸毒",
			"singer": " ",
			"img": "image/null.jpg"
		},
		{
			"name": "I'm So Happy",
			"singer": "中原龍太郎",
			"img": "audio/album/music4.jpg",
			"src": "audio/music4.mp3",
			"lrc": "[by:左千雪]\n[ti:]\n[ar:]\n[al:]\n[by:九九Lrc歌词网～www.99Lrc.net]\n[00:01.27]1　2　Party time!\n[00:08.35]1　2　Party time!\n[00:08.86] dance X 16\n[00:15.44]I'm so Happy that I've found you...\n[00:21.20]I'm so Happy that I've found you...\n[00:25.91]I'm so Happy that I've found you...\n[00:31.32]I'm so Happy that I've found you...\n[00:37.34]Clap Your Hands!\n[00:48.67]I'm so Happy that I've found you...\n[00:53.88]I'm so Happy that I've found you...\n[01:10.12]I'm so Happy...\n"
		}
	],
	[{
			"basic": true,
			"name": "其他",
			"singer": "某不知名白狼",
			"img": "image/pic/head.jpg"
		},
		{
			"name": "404",
			"singer": "-",
			"img": "images/404.jpg",
			"src": "audio/404.mp3",
			"lrc": "music/lrc/最后的旅行.lrc"
		}
	]
];
//加载歌词文件——开发中
for(i in mplayer_song[0]) {
	if(mplayer_song[0][i].lrc_src != undefined) {
		$.get(mplayer_song[0][i].lrc_src, function(data) {
			mplayer_song[0][i].lrc_src = data;
			console.log(i)
		})
	}
}